Tekla.Structures.Analysis.AnalysisObjectEnumerator
The AnalysisObjectEnumerator class provides the means to iterate through analysis object instances.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.EnumDefaultSize
The default size of the enumerator.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.analysisEnumeratorType
The analysis enumerator type.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.id1
The identifier of the object 1.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.object1Type
The type of the object 1.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.id2
The identifier of the object 2.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.object2Type
The type of the object 2.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.objectTypeToSelect
The type of the objects to be selected.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.analysisModelName
The name of the analysis model.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.id3
The identifier of the object 3.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.id4
The identifier of the object 4.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.id5
The identifier of the object 5.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.analysisObjectIDs
The list of indetifier of enumerated objects.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.analysisObjectTypes
The list of types of enumerated objects.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.usingItemList
Are we getting items from the item list

Tekla.Structures.Analysis.AnalysisObjectEnumerator.itemList
The list objects for enumerator which does not get items from DB

Tekla.Structures.Analysis.AnalysisObjectEnumerator.currentItem
The index of the current item.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.currentSelected
The instance of current item.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.selectInstances
This indicates that instance Select() is called when 'Current' item is asked from the enumerator.
The user can set this to 'false' if no members are ever asked from the instance. This is the case
when e.g. asking only a report property from this ID. WARNING: normally user should not
change this value.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.#ctor(Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum,System.String)
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisObjectEnumerator class.
analysisEnumeratorType: The type of the enumerator
analysisModelName: The name of the analysis model.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.#ctor(Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.String,System.Int32,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.Int32,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.Int32,System.Int32,System.Int32)
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisObjectEnumerator class.
analysisEnumeratorType: The type of the enumerator
objectTypeToSelect: The type of the objects to be selected.
analysisModelName: The name of the analysis model.
id1: The identifier of the object 1.
object1Type: The type of the object 1.
id2: The identifier of the object 2.
object2Type: The type of the object 2.
id3: The identifier of the object 3.
id4: The identifier of the object 4.
id5: The identifier of the object 5.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.#ctor(System.Collections.ArrayList)
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisObjectEnumerator class.
items: The list of items

Tekla.Structures.Analysis.AnalysisObjectEnumerator.CurrentSelected
Gets or sets the currently selected item.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.SelectInstances
Gets or sets a value indicating whether the instance's Select() is called when the "Current" item is asked from the enumerator.
The user can set this to "false" if no members are ever asked from the instance. This is the case
when e.g. asking only a report property from this identifier. WARNING: normally the user should not
change this value.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.Current
Gets the current analysis object in the enumerator.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.CurrentItem
Gets or sets the index of the current item.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.System#Collections#IEnumerator#Current
Gets the current object. This is the implementation for the current property required by IEnumerator. The returned object
is always of the type AnalysisObject.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: True if succeeded to move to the next item.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.Refresh
Refreshes the enumerator with latest data at database.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.GetSize
Returns the total amout of items.
Returns: The total amount of items.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.GetEnumerator
Returns a pointer to the existing instance of the class.
This allows the usage of the foreach statement with AnalysisObjectEnumerator.
Returns: The pointer to the existing instance of the class.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.SelectObject(System.Int32)
Selects an AnalysisObject based on an index.
index: The index given.
Returns: Returns an analysis object.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.GetAllFromDB(Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.String,System.Int32,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.Int32,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.Int32,System.Int32,System.Int32)
Gets the identifiers from the analysis database.
analysisEnumeratorType: The type of the enumerator.
objectTypeToSelect: The type of the objects to be selected.
analysisModelName: The name of the analysis model.
id1: The identifier of the object 1.
object1Type: The type of the object 1.
id2: The identifier of the object 2.
object2Type: The type of the object 2.
id3: The identifier of the object 3.
id4: The identifier of the object 4.
id5: The identifier of the object 5.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.RefreshDB
Refreshes the identifiers from the analysis database.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.GetAllFromDB(Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator@)
Gets the objects from DB.
The rules of the enumerator are to be corretly filled in before calling this method.
dotAnalysisObjectEnumerator: The enumerator including possible select rules and filters.